# Guía de ejercicios Pandas DataFrame

En esta guía utilizaremos el siguiente dataset [SF Salaries Dataset](https://www.kaggle.com/kaggle/sf-salaries) extraido desde Kaggle (kaggle.com). Complete cada uno de los ejercicios:

#### 1. Importe la librería pandas con el alias pd

In [1]:
import pandas as pd

#### 2. Lea el siguiente archivo "Salaries.csv" y almacénelo en una variable (nómbrela "sal")
Asegúrese que cuenta con el archivo y se encuentra en la misma carpeta que este notebook.

In [2]:
df = pd.read_csv("../data/Salaries.csv")

#### 3. Despliegue los primeros 4 registros de los datos

In [3]:
df.head(4)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN

#### 4. Despliegue los últimos 2 registros del set de datos

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148652,148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

#### 5. Utilice el método .info() para ver cuántos registros tiene el set de datos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

#### 6. Utilice el método .describe() para obtener estadísticas rápidas del set de datos

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
count,148654.000000,148045.000000,148650.000000,148650.000000,112491.000000,148654.000000,148654.000000,148654.000000,0.0,0.0
mean,74327.500000,66325.448840,5066.059886,3648.767297,25007.893151,74768.321972,93692.554811,2012.522643,NaN,NaN
std,42912.857795,42764.635495,11454.380559,8056.601866,15402.215858,50517.005274,62793.533483,1.117538,NaN,NaN
min,1.000000,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000,NaN,NaN
25%,37164.250000,33588.200000,0.000000,0.000000,11535.395000,36168.995000,44065.650000,2012.000000,NaN,NaN
50%,74327.500000,65007.450000,0.000000,811.270000,28628.620000,71426.610000,92404.090000,2013.000000,NaN,NaN
75%,111490.750000,94691.050000,4658.175000,4236.065000,35566.855000,105839.135000,132876.450000,2014.000000,NaN,NaN
max,148654.000000,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000,NaN,NaN

#### 7. ¿Cuál es el monto del sueldo base más alto? (BasePay)

319275.01

#### 8. ¿Cuál es la mediana del sueldo base?

65007.45

#### 9. ¿Cuál es la media del sueldo base?

66325.44884050643

#### 10. ¿Cuánto fue el monto de sueldo base (BasePay) más alto del año 2013?

In [4]:
# Monto máximo de BasePay en 2013
max_basepay_2013 = df.loc[df['Year'] == 2013, 'BasePay'].max()
max_basepay_2013

np.float64(319275.01)

#### 11. ¿A cuántas personas se les paga tiempo extra? (OvertimePay)

In [6]:
# Número de personas con OvertimePay > 0
num_overtime = (df['OvertimePay'] > 0).sum()
num_overtime

np.int64(71328)

In [5]:
num_overtime = (df['OvertimePay'] > 0).count()
num_overtime

np.int64(148654)

#### 12. ¿Cuál es el cargo de JOSEPH DRISCOLL?
**Nota**: Use mayúsculas (también hay un Joseph Driscoll con minúsculas)

In [ ]:
# Buscar el cargo para JOSEPH DRISCOLL
titles = df.loc[df['EmployeeName'] == 'JOSEPH DRISCOLL', 'JobTitle'].unique()
if len(titles) == 0:
    titles = df.loc[df['EmployeeName'].str.upper() == 'JOSEPH DRISCOLL', 'JobTitle'].unique()
titles

array(['CAPTAIN, FIRE SUPPRESSION'], dtype=object)

#### 13. ¿Cuál es el sueldo total de JOSEPH DRISCOLL incluyendo beneficios?

In [9]:
# Buscar  JOSEPH DRISCOLL y mostrar TotalPayBenefits
mask = df['EmployeeName'] == 'JOSEPH DRISCOLL'
tpb = df.loc[mask, 'TotalPayBenefits']

if tpb.empty:
    print("No se encontró JOSEPH DRISCOLL")
else:
    # Mostrar todos los valores encontrados (si hay más de uno)
    print("TotalPayBenefits para JOSEPH DRISCOLL:")
    print(tpb.to_string(index=False))
    if tpb.nunique() == 1:
        print("\nValor único:", tpb.iloc[0])
    else:
        print(f"\nRegistros encontrados: {len(tpb)}; valores únicos: {tpb.unique()}")

TotalPayBenefits para JOSEPH DRISCOLL:
270324.91

Valor único: 270324.91

#### 14. ¿Cuál es el nombre de la persona mejor pagada? (beneficios incluidos)

In [11]:
# Obtener mayor TotalPayBenefits
max_tpb = df['TotalPayBenefits'].max()
best_paid = df.loc[df['TotalPayBenefits'] == max_tpb, ['EmployeeName', 'JobTitle', 'TotalPayBenefits']]

print(f"Monto máximo (TotalPayBenefits): {max_tpb}")
best_paid.reset_index(drop=True)
best_paid

Monto máximo (TotalPayBenefits): 567595.43

,EmployeeName,JobTitle,TotalPayBenefits
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,567595.43

#### 15. ¿Cuál es el nombre de persona peor pagada (beneficios incluidos)? ¿Nota algo extraño?

In [12]:
# Encontrar la peor pagada según TotalPayBenefits
min_tpb = df['TotalPayBenefits'].min()
worst_paid = df.loc[df['TotalPayBenefits'] == min_tpb, ['EmployeeName', 'JobTitle', 'TotalPayBenefits']]

print(f"Monto mínimo (TotalPayBenefits): {min_tpb}")
worst_paid.reset_index(drop=True)

Monto mínimo (TotalPayBenefits): -618.13

  EmployeeName                    JobTitle  TotalPayBenefits
0    Joe Lopez  Counselor, Log Cabin Ranch           -618.13

#### 16. Agregue una columna que se llame 'Taxes' y que corresponda al 10% del sueldo base

In [13]:
# Agregar columna 'Taxes' 
df['Taxes'] = df['BasePay'] * 0.10

# Verificar los primeros registros
df[['BasePay', 'Taxes']].head()

     BasePay      Taxes
0  167411.18  16741.118
1  155966.02  15596.602
2  212739.13  21273.913
3   77916.00   7791.600
4  134401.60  13440.160

#### 17. ¿Cuánto fue la recaudación de impuestos en el año 2013?

In [14]:
# Recaudación de impuestos
taxes_2013 = df.loc[df['Year'] == 2013, 'Taxes'].dropna().sum()
taxes_2013

np.float64(257638074.804)

#### 18. Desafío: calcule el promedio del 10% de sueldos más altos (BasePay)

In [ ]:
# Promedio del 10% de sueldos más altos (BasePay)
basepay = sal['BasePay'].dropna()
n = max(1, int(len(basepay) * 0.10))  # asegurar al menos 1 registro
top10 = basepay.nlargest(n)
promedio_top10 = top10.mean()
promedio_top10

#### 19. Calcule el promedio del 10% de sueldos más bajos (BasePay)

In [ ]:
# Promedio del 10% de sueldos más bajos (BasePay)
try:
    basepay_nonnull = basepay  # reuse variable definido previamente
except NameError:
    basepay_nonnull = df['BasePay'].dropna()

n_low = max(1, int(len(basepay_nonnull) * 0.10))  # al menos 1 registro
bottom10 = basepay_nonnull.nsmallest(n_low)
promedio_bottom10 = bottom10.mean()
promedio_bottom10

3341.6703639089546